Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: One resource type is defined by this extension: a file descriptor returnded by dio_open().
pt_br: Constantes Predefinidas

source: For related functions such as dirname(), is_dir(), mkdir(), and rmdir(), see the Filesystem section.
pt_br: Para funções relacionadas como dirname(), is_dir(), mkdir() e rmdir(), veja a seção Filesystem.

source: Therefore, if you want to read an XML file and write a modified version, use DomDocument_create_element(), DomDocument_create_text_node(), set_attribute(), etc. and finally the DomDocument_dump_mem() function.
pt_br: Requisitos

source: Table 4.
pt_br: Tabela 4.

source: Table 5.
pt_br: Tabela 5.

source: Table 6.
pt_br: Tabela 6.

source: Table 7.
pt_br: Tabela 7.

source: Table 8.
pt_br: Tabela 8.

source: Table 9.
pt_br: Tabela 9.

source: Table 10.
pt_br: Tabela 10.

source: Table 11.
pt_br: Tabela 11.

source: ?php $xmlstr = "?xml version='1.0 'standalone='yes'? !DOCTYPE chapter SYSTEM' / share / sgml / Norman_Walsh / db3xml10 / db3xml10.dtd '[!ENTITY sp \"spanish\"] !- - lsfj - - chapter language='en' title language='en 'Title / title para language='ge' amp;sp; !- - comment - - informaltable ID='findme 'language=' amp;sp; 'tgroup cols='3' tbody row entry a1 / entry entry morerows='1 'b1 / entry entry c1 / entry / row row entry a2 / entry entry c2 / entry / row row entry a3 / entry entry b3 / entry entry c3 / entry / row / tbody / tgroup / informaltable / para / chapter ";?
pt_br: DomDocumentType - entities

source: These are functions dealing with error handling and logging.
pt_br: Error Handling and Logging Functions

source: The error reporting functions allow you to customize what level and kind of error feedback is given, ranging from simple notices to customized functions returned during errors.
pt_br: Requisitos

source: This is to make it easier to find scripts that need to be rewritten to using the string concatenator instead (.).
pt_br: Constantes Predefinidas

source: Note that only '_BAR_', '~',' !', and '' will be understood within php.ini, however, and that no bitwise operators will be understood within php3.ini.
pt_br: Exemplos

source: ?php / / we will do our own error handling error_reporting( 0); / / user defined error handling function function userErrorHandler ($errno, $errmsg, $filename, $linenum, $vars) {/ / timestamp for the error entry $dt = date("Y-m-d H:i:s (T)"); / / define an assoc array of error string / / in reality the only entries we should / / consider are 2,8,256,512 and 1024 $errortype = array (1 = "Error", 2 = "Warning", 4 = "Parsing Error", 8 = "Notice", 16 = "Core Error", 32 = "Core Warning", 64 = "Compile Error", 128 = "Compile Warning", 256 = "User Error", 512 = "User Warning", 1024= "User Notice "); / / set of errors for which a var trace will be saved $user_errors = array(E_USER_ERROR, E_USER_WARNING, E_USER_NOTICE); $err =" errorentry \n"; $err .= "\t datetime ".$dt. "/ datetime \n"; $err .= "\t errornum ".$errno." / errornum \n"; $err .= "\t errortype ".$errortype[$errno]. "/ errortype \n"; $err .= "\t errormsg ".$errmsg." / errormsg \n"; $err .= "\t scriptname ".$filename. "/ scriptname \n"; $err .= "\t scriptlinenum ".$linenum." / scriptlinenum \n"; if (in_array($errno, $user_errors)) $err .= "\t vartrace ".wddx_serialize_value($vars ,"Variables"). "/ vartrace \n"; $err .=" / errorentry \n\n"; / / for testing / / echo $err; / / save to the error log, and e-mail me if there is a critical user error error_log($err, 3, "/ usr / local / php4 / error.log"); if ($errno == E_USER_ERROR) mail("phpdev@example.com" ,"Critical User Error",$err);} function distance ($vect1, $vect2) {if (!is_array($vect1) _BAR_ _BAR_ !is_array($vect2)) {trigger_error("Incorrect parameters, arrays expected", E_USER_ERROR); return NULL;} if (count($vect1) != count($vect2)) {trigger_error("Vectors need to be of the same size", E_USER_ERROR); return NULL;} for ($i=0; $i count($vect1); $i++) {$c1 = $vect1[$i]; $c2 = $vect2[$i]; $d = 0.0; if (!is_numeric($c1)) {trigger_error("Coordinate $i in vector 1 is not a number, using zero", E_USER_WARNING); $c1 = 0.0;} if (!is_numeric($c2)) {trigger_error("Coordinate $i in vector 2 is not a number, using zero", E_USER_WARNING); $c2 = 0.0;} $d += $c2*$c2 - $c1*$c1;} return sqrt($d);} $old_error_handler = set_error_handler("userErrorHandler"); / / undefined constant, generates a warning $t = I_AM_NOT_DEFINED; / / define some "vectors" $a = array(2,3 ,"foo"); $b = array(5.5, 4.3, -1.6); $c = array (1,-3); / / generate a user error $t1 = distance($c,$b) ."\n"; / / generate another user error $t2 = distance($b ,"i am not an array") ."\n"; / / generate a warning $t3 = distance($a,$b) ."\n";?
pt_br: Veja Também

source: These functions allow you to access FrontBase database servers.
pt_br: FrontBase Functions

source: This will force PHP to use the client libraries installed by FrontBase, avoiding any conflicts.
pt_br: Configuração durante execução

source: PHP_INI_SYSTEM
pt_br: Tipos Resource

source: Forms Data Format (FDF) is a format for handling forms within PDF documents.
pt_br: Introdução

source: The FDF toolkit library is available in binary form only, platforms supported by Adobe are Win32, Linux, Solaris and AIX.
pt_br: Instalação

source: A fdf resource is a handle to an opened fdf file. fdf resources may be obtained using fdf_create(), fdf_open() and fdf_open_string().
pt_br: Constantes Predefinidas

source: These functions allow read-only access to data stored in filePro databases.
pt_br: Introdução

source: Filesystem and Streams Configuration Options
pt_br: O comportamento dessas funções podem ser modificado pelas configurações do php.ini.

source: allow_url_fopen
pt_br: Alterável

source: This option enables the URL-aware fopen wrappers that enable accessing URL object like files.
pt_br: Esta opção ativa o dispositivo URL fopen wrappers que permite o acesso a objetos URL como arquivos.

source: Default wrappers are provided for the access of remote files using the ftp or http protocol, some extensions like zlib may register additional wrappers.
pt_br: São disponibilizados por padrão wrappers para acesso de arquivos remotos utilizando os protocolos FTP ou HTTP, e algumas estensões como a zlib podem registar wrappers adicionais.

source: This option was introduced immediately after the release of version 4.0.3.
pt_br: Esta opção foi introduzida imediatamente antes da liberação da versão 4.0.3.

source: For versions up to and including 4.0.3 you can only disable this feature at compile time by using the configuration switch --disable-url-fopen-wrapper.
pt_br: Até essa versão e incluindo a 4.0.3, você somente podia desabilitar este recurso na compilação, usando a opção --disable-url-fopen-wrapper.

source: On Windows versions prior to PHP 4.3, the following functions do not support remote file accesing: include(), include_once(), require(), require_once() and the imagecreatefromXXX functions in the Reference XLI, Image functions extension.
pt_br: Nas versões Windows anterioes a PHP 4.3, as funções seguintes não suportavam acesso de arquivos remotos: include(), include_once(), require(), require_once() e as funções imagecreatefromXXX da extensão Referência XLI, Image functions.

source: Define the user agent for PHP to send.
pt_br: Define o user agent que o PHP irá enviar.

source: Default timeout (in seconds) for socket based streams.
pt_br: Timeout padrão (em segundos) para streams baseados em socket.

source: This configuration option was introduced in PHP 4.3.
pt_br: Esta opção de configuração foi incluida no PHP 4.3.

source: Define the anonymous ftp password (your email address).
pt_br: Define a senha do FTP anonimo (seu endereço de e-mail).

source: When turned on, PHP will examine the data read by fgets() and file() to see if it is using Unix, MS-Dos or Macintosh line-ending conventions.
pt_br: Quando ativo, o PHP irá examinar os dados lidos por fgets() e file() para verificar se está sendo utilizado a convensão de fim de linha Unix, MS-DOS ou Macintosh.

source: This enables PHP to interoperate with Macintosh systems, but defaults to Off, as there is a very small performance penalty when detecting the EOL conventions for the first line, and also because people using carriage-returns as item separators under Unix systems would experience non-backwards-compatible behaviour.
pt_br: Isto ativa a interoperabilidade do PHP com sistemas Macintosh, mas seu padrão é Off, porque isso causa uma pequena perda de performance na detecção da convenção de fim de linha num primeiro momento e porque as pessoas que utilizam o fim de linha como separadores de itens sob sistemas Unix podem experimentar problemas de falta de compatibilidade.

source: For related functions, see also the Directory and Program Execution sections.
pt_br: Veja Também

source: For a list and explanation of the various URL wrappers that can be used as remote files, see also Appendix I.
pt_br: Para uma lista e descrição dos vários wrappers URL que podem ser utilizados como arquivos remotos, veja em Apêndice I.

source: FriBiDi is a free implementation of the Unicode Bidirectional Algorithm.
pt_br: Requisitos

source: You must download and install the FriBiDi package.
pt_br: Instalação

source: To enable FriBiDi support in PHP you must compile --with-fribidi[ =DIR] where DIR is the FriBiDi install directory.
pt_br: Configuração durante execução

source: FTP example
pt_br: Exemplo 1.

source: Please see the gettext documentation for your system for a thorough explanation of these functions or view the docs at http: / /www.gnu.org / manual / gettext / index.html.
pt_br: Requisitos

source: Starting with PHP 4.2.3 the name changed to libintl-1.dll
pt_br: Configuração durante execução

source: These functions allow you to work with arbitrary-length integers using the GNU MP library.
pt_br: GMP functions

source: Most GMP functions accept GMP number arguments, defined as resource below.
pt_br: Nota:

source: Some functions may require more recent version of the GMP library.
pt_br: Instalação

source: In order to have these functions available, you must compile PHP with GMP support by using the --with-gmp option.
pt_br: Configuração durante execução

source: Factorial function using GMP
pt_br: Exemplo 1.

source: Hyperwave has been developed at IICM in Graz.
pt_br: Hyperwave API functions

source: Certain attributes are always set by the Hyperwave server, other may be modified by the user.
pt_br: Requisitos

source: In order to activate the hwapi support in PHP you will have to install the Hyperwave SDK first.
pt_br: Instalação

source: After installing the Hyperwave SDK, configure PHP with --with-hwapi[ =DIR].
pt_br: Integration with Apache

source: The integration with Apache and possible other servers is already described in the Hyperwave module which has been the first extension to connect a Hyperwave Server.
pt_br: Configuração durante execução

source: Number of object records.
pt_br: Requisitos

source: This extension needs a Hyperwave server downloadable from http: / /www.hyperwave.com /.
pt_br: Instalação

source: As an alternative to the Rewrite Engine, you can also consider using the Apache ErrorDocument directive, but be aware, that ErrorDocument redirected pages cannot receive POST data.
pt_br: Configuração durante execução

source: InterBase is a popular database put out by Borland / Inprise.
pt_br: InterBase functions

source: magic_quotes_sybase = On
pt_br: Requisitos

source: Therfore you don 't need to copy gds32.dll from the DLL folder.
pt_br: Configuração durante execução

source: PHP_INI_ALL
pt_br: Tipos Resource

source: This module contains an interface to the iconv library functions.
pt_br: Introdução

source: Starting with PHP 4.2.1 the name changed to iconv.dll
pt_br: Configuração durante execução

source: Table 2. iconv constants
pt_br: Tabela 2. iconv constants

source: Writing implementation-dependent scripts with these constants should be discouraged.
pt_br: Veja Também

source: IUS 9.x support is partly finished: the new data types are there, but SLOB and CLOB support is still under construction.
pt_br: Requisitos

source: Make sure that the "INFORMIXDIR" variable has been set, and that $INFORMIXDIR / bin is in your PATH before you run the "configure "script.
pt_br: Instalação

source: To be able to use the functions defined in this module you must compile your PHP interpreter using the configure line --with_informix[ =DIR], where DIR is the Informix base install directory, defaults to nothing.
pt_br: Configuração durante execução

source: You can override this setting at runtime with ifx_nullformat().
pt_br: Constantes Predefinidas

source: PHP is not limited to creating just HTML output.
pt_br: Introdução

source: Read requirements section about how to expand image capabilities to read, write and modify images and to read meta data of pictures taken by digital cameras.
pt_br: Requisitos

source: To enable support for native TrueType string function add --enable-gd-native-ttf.
pt_br: Configuração durante execução

source: The default is JIS.
pt_br: Tipos Resource

source: PNG creation with PHP
pt_br: Exemplo 1.

source: These functions are not limited to the IMAP protocol, despite their name.
pt_br: IMAP, POP3 and NNTP functions

source: This is due to the fact that they both share the same internal symbol.
pt_br: Configuração durante execução

source: The probably best known function of PHP - phpinfo() - can be found here.
pt_br: Requisitos

source: If magic_quotes_sybase is also on, a single-quote is escaped with a single-quote instead of a backslash.
pt_br: Tipos Resource

source: Table 3. phpinfo() constants
pt_br: Tabela 3. phpinfo() constants

source: These functions allow you to access Ingres II database servers.
pt_br: Introdução

source: If you already used PHP extensions to access other database servers, note that Ingres doesn' t allow concurrent queries and / or transaction over one connection, thus you won't find any result or transaction handle in this extension.
pt_br: Nota:

source: Adding "export II_SYSTEM=" / home / ingres / II" in the script that starts Apache, just before launching httpd, should be fine.
pt_br: Configuração durante execução

source: With IRCG you can rapidly stream XML data to thousands of concurrently connected users.
pt_br: IRC Gateway Functions

source: We urge you to use the provided installation script.
pt_br: Configuração durante execução

source: In order to enable this module on a Windows environment, you must copy jvm.dll from the DLL folder of the PHP / Win32 binary package to the SYSTEM32 folder of your windows machine. (Ex:C:\WINNT\SYSTEM32 or C:\WINDOWS\SYSTEM32)
pt_br: Configuração durante execução

source: Java Example
pt_br: Exemplo 1.

source: LDAP is the Lightweight Directory Access Protocol, and is a protocol used to access "Directory Servers".
pt_br: LDAP functions

source: The Netscape SDK contains a helpful Programmer 's Guide in HTML format.
pt_br: Requisitos

source: You will need to get and compile LDAP client libraries from either the University of Michigan ldap-3.3 package or the Netscape Directory SDK 3.0 to compile PHP with LDAP support.
pt_br: Instalação

source: ?php / / basic sequence with LDAP is connect, bind, search, interpret search / / result, close connection echo "h3 LDAP query test / h3"; echo "Connecting.. ."; $ds=ldap_connect("localhost"); / / must be a valid LDAP server! echo "connect result is ".$ds. "p"; if ($ds) {echo "Binding.. ."; $r=ldap_bind($ds); / / this is an "anonymous "bind, typically / / read-only access echo "Bind result is ".$r." p "; echo "Searching for (sn=S*).. ."; / / Search surname entry $sr=ldap_search($ds ,"o=My Company, c=US", "sn=S*"); echo "Search result is ".$sr." p "; echo "Number of entires returned is ".ldap_count_entries($ds,$sr)." p "; echo "Getting entries... p"; $info = ldap_get_entries($ds, $sr); echo "Data for ".$info["count"]. "items returned: p"; for ($i=0; $i $info["count"]; $i++) {echo "dn is: ". $info[$i]["dn"]." br "; echo "first cn entry is:". $info[$i]["cn"][0]. "br"; echo "first email entry is: ". $info[$i]["mail"][0]." p ";} echo "Closing connection"; ldap_close($ds);} else {echo" h4 Unable to connect to LDAP server / h4 ";}?
pt_br: Using the PHP LDAP calls

source: The mail() function allows you to send mail.
pt_br: XLIX.

source: "localhost"
pt_br: Instalação

source: smtp_port
pt_br: Não há nenhuma instalação nescessária para utilizar estas funções, elas fazem parte do núcleo do PHP.

source: sendmail_path
pt_br: Apenas para usuários de Windows:

source: DNS name or IP address of the SMTP server PHP should use for mail sent with the mail() function.
pt_br: Número da porta para conectar ao servidor especificado com a configuração de SMTP quando enviando mail com mail(); por definição 25.

source: Used under Windows only:
pt_br: Apenas disponível desde PHP 4.3.0.

source: Only available since PHP 4.3.0.
pt_br: O "From:" endereço de email seria usado no envio de PHP em Windows.

source: Where the sendmail program can be found, usually / usr / sbin / sendmail or / usr / lib / sendmail. configure does an honest attempt of locating this one for you and set a default, but if it fails, you can set it here.
pt_br: Sistemas não utilizando sendmail definiriam esta diretiva para sendmail wrapper / replacement deles.

source: Systems not using sendmail should set this directive to the sendmail wrapper / replacement their mail system offers, if any.
pt_br: Por exemplo, Qmail usuários pode normalmente definí-los para / var / qmail / bin / sendmail ou / var / qmail / bin / qmail-inject.

source: For example, Qmail users can normally set it to / var / qmail / bin / sendmail or / var / qmail / bin / qmail-inject.
pt_br: Tipos Resource

source: qmail-inject does not require any option to process mail correctly.
pt_br: Esta extensão não possui nenhum tipo resource.

source: These math functions will only handle values within the range of the integer and float types on your computer (this corresponds currently to the C types long resp. double).
pt_br: Estas funções matemáticas somente suportam valores dentro do tamanho integer and float do seu computador. (estes correspondem atualmente aos tipos do C long e double) Se você precisa manipular números maiores, procure funções de matemática com precisão arbitrária.

source: If you need to handle bigger numbers, take a look at the arbitrary precision math functions.
pt_br: Nenhuma biblioteca externa é necessária para compilar esta extensão.

source: Math constants
pt_br: Constantes matemáticas

source: sqrt( pi) [4.0.2]
pt_br: raiz_quadrada( pi) [4.0.2]

source: 2 / sqrt( pi)
pt_br: 2 / raiz_quadrada( pi)

source: sqrt( 2)
pt_br: raiz_quadrada( 2)

source: sqrt( 3) [4.0.2]
pt_br: raiz_quadrada( 3) [4.0.2]

source: 1 / sqrt( 2)
pt_br: 1 / raiz_quadrada( 2)

source: Euler constant [4.0.2]
pt_br: Constante de Euler [4.0.2]

source: There are many languages in which all characters can be expressed by single byte.
pt_br: Multi-Byte String Functions

source: See the PostgreSQL manual for details.
pt_br: Instalação

source: Enable regular expression functions with multibyte character support.
pt_br: Configuração durante execução

source: Example 1. php.ini setting example
pt_br: Exemplo 1. php.ini setting example

source: Example 2. php.ini setting for EUC-JP users
pt_br: Exemplo 2. php.ini setting for EUC-JP users

source: Example 3. php.ini setting for SJIS users
pt_br: Exemplo 3. php.ini setting for SJIS users

source: ;; Enable Output Buffering output_buffering = On;; Set mb_output_handler to enable output conversion output_handler = mb_output_handler;; Set HTTP header charset default_charset = Shift_JIS;; Set default language to Japanese mbstring.language = Japanese;; Set http input encoding conversion to auto mbstring.http_input = auto;; Convert to SJIS mbstring.http_output = SJIS;; Set internal encoding to EUC-JP mbstring.internal_encoding = EUC-JP;; Do not print invalid characters mbstring.substitute_character = none
pt_br: Tipos Resource

source: Example 5. php.ini setting example
pt_br: Exemplo 5. php.ini setting example

source: Example 6.
pt_br: Exemplo 6.

source: ?php / / Enable output character encoding conversion only for this page / / Set HTTP output character encoding to SJIS mb_http_output( 'SJIS'); / / Start buffering and specify "mb_output_handler "as / / callback function ob_start('mb_output_handler');?
pt_br: Supported Character Encodings

source: Note: "Supported character encoding" does not mean that it works as internal character code.
pt_br: Nota: "Supported character encoding" does not mean that it works as internal character code.

source: MCAL stands for Modular Calendar Access Library.
pt_br: MCAL functions

source: Grab the latest version from http: / /mcal.chek.com / and compile and install it.
pt_br: Instalação

source: After you installed the mcal library, to get these functions to work, you have to compile PHP -with-mcal[ =DIR].
pt_br: Configuração durante execução

source: Additionally, it supports RC6 and IDEA which are considered "non-free".
pt_br: Requisitos

source: Make sure you compile libmcrypt with the option --disable-posix-threads.
pt_br: Configuração durante execução

source: Alternatively, you can transmit the IV together with the encrypted data (see chapter 9.3 of Applied Cryptography by Schneier (ISBN 0-471-11709-9) for a discussion of this topic).
pt_br: Exemplos

source: These functions interface the MCVE API (libmcve), allowing you to work directly with MCVE from your PHP scripts.
pt_br: MCVE Payment Functions

source: These functions are intended to work with mhash.
pt_br: Mhash - Funções de hash

source: Mhash can be used to create checksums, message digests, message authentication codes, and more.
pt_br: Essas funções são planejadas para trabalhar com mhash.

source: This is an interface to the mhash library. mhash supports a wide variety of hash algorithms such as MD5, SHA1, GOST, and many others.
pt_br: Esta é uma interface para a biblioteca mhash.

source: For a complete list of supported hashes, refer to the documentation of mhash.
pt_br: O mhash suporta uma grande variedade de algoritmos de hash como MD5, SHA1, GOST e muitos outros.

source: The general rule is that you can access the hash algorithm from PHP with MHASH_HASHNAME.
pt_br: Para uma lista completa das hashs suportadas, verifique a documentação do mhash.

source: For example, to access TIGER you use the PHP constant MHASH_TIGER.
pt_br: A regra geral é: você pode acessar o algoritmo de hash a partir do PHP com MHASH_NOMEdoHASH, Por exemplo, para acessar o algoritmo TIGER, você utiliza a constante MHASH_TIGER.

source: To use it, download the mhash distribution from its web site and follow the included installation instructions.
pt_br: Para usá-las, faça o download da distribuição do mhash em http: / /mhash.sourceforge.net / e siga as instruções de instalação inclusas.

source: You need to compile PHP with the --with-mhash[ =DIR] parameter to enable this extension.
pt_br: Você precisará compilar o PHP com o parametro --with-mhash[ =DIR] para habilitar esta extensão.

source: DIR is the mhash install directory.
pt_br: DIR é o diretório de instalação do mhash.

source: Here is a list of hashes which are currently supported by mhash.
pt_br: Aqui está a lista de hashes que são atualmente suportadas por mhash.

source: If a hash is not listed here, but is listed by mhash as supported, you can safely assume that this documentation is outdated.
pt_br: Se uma hash não está listada aqui, mas é listada pelo mhash como suportada, você pode assumir seguramente que esta documentação está desatualizada.

source: Compute the MD5 digest and hmac and print it out as hex
pt_br: Calcular o MD5 digest e hmac e imprimir como hex
